/*
У формі профілю користувач вказує дату народження. 
Після натискання кнопки сайт показує, скільки повних 
днів людина вже прожила.
•	Після кліку на .calc-days треба прочитати значення 
з .birth-date і створити з нього об’єкт Date.
•	Поточний момент часу отримати через Date.now().
•	Різницю між датами порахувати в мілісекундах і 
перевести в повні дні через Math.floor.
•	У .days-result показати рядок 
у форматі "Минуло <n> днів".
•	Якщо поле .birth-date порожнє, у .days-result
 показати "Вкажіть дату народження" і не виконувати розрахунок.
*/

import { onCalcDaysBtn } from './js/handlers';
import { refs } from './js/refs';

refs.calcDaysBtn.addEventListener('click', onCalcDaysBtn);
